/* CREATED BY PL1C */



DECLARE Predicate P1 : 0;
DECLARE Predicate P2 : 1;
DECLARE Predicate P3 : 3;
DECLARE Function c : 0;
DECLARE Function f : 1;
DECLARE Function g : 2;
DECLARE Variable x : int;
DECLARE Variable y : int;
DECLARE Variable z : int;


((EXIST[x]((P1() | ~(P2(x)))) | ~(P2(1))) | EXIST[z](ALL[y](P3(c, f(z), g(13, y)))));
