/* Created by PL1C */

DECLARE PREDICATE P1         : 0
DECLARE PREDICATE P2         : 1
DECLARE PREDICATE P3         : 3
DECLARE FUNCTION  c          : 0
DECLARE FUNCTION  f          : 1
DECLARE FUNCTION  g          : 2
DECLARE VARIABLE  x          : int
DECLARE VARIABLE  y          : int
DECLARE VARIABLE  z          : int

EXIST[x](P1() | ~P2(x)) | ~P2(1) | EXIST[z]ALL[y]P3(c,f(z),g(13,y)) ;

