/* Kuerbis Aufgabe */

DECLARE PREDICATE A : 0
DECLARE PREDICATE B : 0 
DECLARE PREDICATE C : 0

A() & (~B() | C()) & (~(B() -> C()) | (C() <-> ~A())) ;
