/* Created by PL1C */

DECLARE PREDICATE A          : 0
DECLARE PREDICATE B          : 0
DECLARE PREDICATE C          : 0

A() & B() & C() | (~A() | ~B()) & ~C() ;

